fanqh/ETH_Mange/Project/src/stm32f107 - 副本.c
/**
  ******************************************************************************
  * @file       USART.c 
  * @author  www.armjishu.com 神舟系列
  * @version V1.0
  * @Library Using STM32F10X_STDPERIPH_VERSION V3.3.0
  * @date    04/16/2010
  * @brief   USART program body
  *****************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "stm32_eth.h"
#include "stm32f107.h"
#include "stm32_eval.h"
#include "i2c_ee.h"
#include <usart.h>
#include <stdio.h>
#include "stm32_eth.h"


#include "interface/sd.h"
#include "efs.h"
#include "ls.h"

#include "stm32f10x_rtc.h"
#include "stm32f10x_pwr.h"
#include "stm32f10x_can.h"
#include "ARMJISHU_TouchScreen.h"

extern void Delay_ARMJISHU(__IO uint32_t nCount);
extern void Ethernet_MDIO_Config(void);

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define DP83848_PHY        /* Ethernet pins mapped on STM3210C-EVAL Board */
#define PHY_ADDRESS       0x00//lihao /* Relative to STM3210C-EVAL Board */

//#define MII_MODE          /* MII mode for STM3210C-EVAL Board (MB784) (check jumpers setting) */
#define RMII_MODE       /* RMII mode for STM3210C-EVAL Board (MB784) (check jumpers setting) */

/*--------------- LCD Messages ---------------*/
#define MESSAGE1   "  www.armjishu.com  "
#define MESSAGE2   "     STM32F107      "
#define MESSAGE3   " Connectivity Line  "
#define MESSAGE4   "   * LwIP demos *   "


/* Private macro -------------------------------------------------------------*/
/* Select MSD Card: ChipSelect pin low  */
#define MSD_CS_LOW()     GPIO_ResetBits(GPIOD, GPIO_Pin_11)
/* Deselect MSD Card: ChipSelect pin high */
#define MSD_CS_HIGH()    GPIO_SetBits(GPIOD, GPIO_Pin_11)

/* Private variables ---------------------------------------------------------*/
EmbeddedFileSystem  efs;
DirList             list;
EmbeddedFile        file_SD_Card;

/* Private functions ---------------------------------------------------------*/
void GPIO_Configuration(void);
void NVIC_Configuration(void);
void ADC_Configuration(void);
void Ethernet_Security(void);
void Ethernet_Configuration(void);
TestStatus SdCardInit(void);
void SdCardTest(void);
void GPIO_KEY_Config(void);
TestStatus USART_COM_Check(void);

void Time_Display(uint32_t TimeVar);
void  RTC_Test(void);

TestStatus Dual_CAN_Test(void);
/**
  * @brief  Setup STM32 system (clocks, Ethernet, GPIO, NVIC) and STM3210C-EVAL resources.
  * @param  None
  * @retval None
  */
#if 0
void System_Setup(void)
{
  RCC_ClocksTypeDef RCC_Clocks;

  /* Setup STM32 clock, PLL and Flash configuration) */
  SystemInit();

  /* Enable USART2 clock */
 // RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
	  /* Configure the USART port */  
  USART_COM1_Init();
  /* Enable ETHERNET clock  */
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_ETH_MAC | RCC_AHBPeriph_ETH_MAC_Tx |
                        RCC_AHBPeriph_ETH_MAC_Rx, ENABLE);

  /* Enable GPIOs and ADC1 clocks */
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB | RCC_APB2Periph_GPIOC |
                         RCC_APB2Periph_GPIOD | RCC_APB2Periph_GPIOE | RCC_APB2Periph_AFIO |
						 RCC_APB2Periph_ADC1, ENABLE);
  
  /* NVIC configuration */
  NVIC_Configuration();  

  /* Configure the GPIO ports */
  GPIO_Configuration();

  /* to assure Ethernet Phy work well */ //lihao
  Ethernet_Security(); 
  
  /* RTC TEST */
  //RTC_Test();

  /* Configure the Ethernet peripheral */
  Ethernet_Configuration();

  GPIO_KEY_Config();
  
  /* SystTick configuration: an interrupt every 10ms */
  RCC_GetClocksFreq(&RCC_Clocks);
  SysTick_Config(RCC_Clocks.SYSCLK_Frequency / 100);

  /* Update the SysTick IRQ priority should be higher than the Ethernet IRQ */
  /* The Localtime should be updated during the Ethernet packets processing */
  NVIC_SetPriority (SysTick_IRQn, 1);  
  
  /* Configure the Key button */ 
  STM_EVAL_PBInit(Button_KEY, Mode_GPIO);
}
#else
void System_Setup(void)
{
  RCC_ClocksTypeDef RCC_Clocks;

  /* Setup STM32 clock, PLL and Flash configuration) */
  SystemInit();

  /* Enable USART2 clock */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);


  /* Enable ETHERNET clock  */
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_ETH_MAC | RCC_AHBPeriph_ETH_MAC_Tx |
                        RCC_AHBPeriph_ETH_MAC_Rx, ENABLE);

  /* Enable GPIOs and ADC1 clocks */
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB | RCC_APB2Periph_GPIOC |
                         RCC_APB2Periph_GPIOD | RCC_APB2Periph_GPIOE | RCC_APB2Periph_AFIO |
						 RCC_APB2Periph_ADC1, ENABLE);
  
  /* NVIC configuration */
  NVIC_Configuration();  

  /* Configure the GPIO ports */
  GPIO_Configuration();

  /* to assure Ethernet Phy work well */ //lihao
  Ethernet_Security(); 
  
  /* ADC configuration */
  ADC_Configuration();

  /* Configure the BEEP ??? */
  BEEP_Configuration();
  STM_EVAL_BEEPOn();
  
  /* Configure the USART port */  
  USART_COM1_Init();
  
  STM_EVAL_BEEPOff();

  /* Initialize the STM3210C-EVAL's LCD */
  STM3210C_LCD_Init();

  STM_EVAL_BEEPOff();
      
  /* Initialize STM3210C-EVAL's LEDs */
  STM_EVAL_LEDInit(LED1);
  STM_EVAL_LEDInit(LED2);
  STM_EVAL_LEDInit(LED3);
  STM_EVAL_LEDInit(LED4);

  /* Turn on leds available on STM3210X-EVAL */
  STM_EVAL_LEDOn(LED1);
  STM_EVAL_LEDOn(LED2);
  STM_EVAL_LEDOn(LED3);
  STM_EVAL_LEDOn(LED4);

  /* Clear the LCD */
  LCD_Clear(Blue);

  /* Set the LCD Back Color */
  LCD_SetBackColor(Blue);

  /* Set the LCD Text Color */
  LCD_SetTextColor(White);

  /* Display message on the LCD*/
  LCD_DisplayStringLine(Line0, MESSAGE1);
  LCD_DisplayStringLine(Line1, MESSAGE2);
  LCD_DisplayStringLine(Line2, MESSAGE3);
  LCD_DisplayStringLine(Line3, MESSAGE4);
  LCD_DisplayWelcomeStr(Line9);  

  LCD_DisplayStringLine(Line7, "   EEPROM TEST....   ");
  /* EEPROM 24C02 TEST */
  if(FAILED == ARMJISHU_EEPROM_TEST())
  {
    printf(" --->FAILED!\n\r"); 
    LCD_DisplayStringLine(Line7, "EEPROM TEST *FAILED!");
  }
  else
  {
    printf(" --->PASSED!\n\r"); 
    LCD_DisplayStringLine(Line7, "EEPROM TEST PASSED!!");
  }
  
  ADS7843_Init();
  
  /* RTC TEST */
  //RTC_Test();

  /* Configure the Ethernet peripheral */
  Ethernet_Configuration();

