fanqh/ETH_Mange/Project/src/stm32f107 - 副本.c
  /* MCO pin configuration--------------------------------------- */
  /* Configure MCO (PA8) as alternate function push-pull */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_Init(GPIOA, &GPIO_InitStructure);

}
#endif

/**
  * @brief  Configures the ADC.
  * @param  None
  * @retval None
  */
void ADC_Configuration(void)
{
  ADC_InitTypeDef ADC_InitStructure;

  /* ADC1 Configuration ------------------------------------------------------*/
  ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
  ADC_InitStructure.ADC_ScanConvMode = DISABLE;
  ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
  ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
  ADC_InitStructure.ADC_NbrOfChannel = 1;
  ADC_Init(ADC1, &ADC_InitStructure);

  /* ADC1 regular channel14 configuration */
  ADC_RegularChannelConfig(ADC1, ADC_Channel_10, 1, ADC_SampleTime_13Cycles5);

  /* Enable ADC1 */
  ADC_Cmd(ADC1, ENABLE);

  /* Start ADC1 Software Conversion */
  ADC_SoftwareStartConvCmd(ADC1, ENABLE);
}

/**
  * @brief  Configures the nested vectored interrupt controller.
  * @param  None
  * @retval None
  */
void NVIC_Configuration(void)
{
  NVIC_InitTypeDef   NVIC_InitStructure;

  /* Set the Vector Table base location at 0x08000000 */
  NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x0);

  /* 2 bit for pre-emption priority, 2 bits for subpriority */
  NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2); 
  
  /* Enable the Ethernet global Interrupt 使能以太网中断 */
  NVIC_InitStructure.NVIC_IRQChannel = ETH_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);    
  
}

/*******************************************************************************
* Function Name  : GPIO_KEY_Config.
* Description    : Configures the Extension Button.
* Input          : None.
* Output         : None.
* Return         : None.
* Update         ：www.armjishu.com 
*******************************************************************************/
void GPIO_KEY_Config(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;

  /* Configure KEY1 Button */
  RCC_APB2PeriphClockCmd(RCC_KEY1, ENABLE);

  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_InitStructure.GPIO_Pin = GPIO_KEY1;
  GPIO_Init(GPIO_KEY1_PORT, &GPIO_InitStructure);

  /* Configure KEY2 Button */
  RCC_APB2PeriphClockCmd(RCC_KEY2, ENABLE);

  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_InitStructure.GPIO_Pin = GPIO_KEY2;
  GPIO_Init(GPIO_KEY2_PORT, &GPIO_InitStructure);

  /* Configure KEY3 Button */
  RCC_APB2PeriphClockCmd(RCC_KEY3, ENABLE);

  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_InitStructure.GPIO_Pin = GPIO_KEY3;
  GPIO_Init(GPIO_KEY3_PORT, &GPIO_InitStructure);  

  /* Configure KEY4 Button */
  RCC_APB2PeriphClockCmd(RCC_KEY4, ENABLE);

  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_InitStructure.GPIO_Pin = GPIO_KEY4;
  GPIO_Init(GPIO_KEY4_PORT, &GPIO_InitStructure);

  /* Configure 315M Button */
  RCC_APB2PeriphClockCmd(RCC_315M, ENABLE);

  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_InitStructure.GPIO_Pin = GPIO_315M;
  GPIO_Init(GPIO_315M_PORT, &GPIO_InitStructure);

}

/*******************************************************************************
* Function Name  : Check_315M_Wireless
* Description    : Reads key from Check_315M_Wireless.
* Input          : None
* Output         : None
* Return         : Return 1 when data valid else 0
* Update         ：www.armjishu.com 
*******************************************************************************/
u8 Check_315M_Wireless(void)
{
  /* 315M wireless is pressed */
  if(!GPIO_ReadInputDataBit(GPIO_315M_PORT, GPIO_315M))
  {
    return 1; 
  }
  else
  {
    return 0; 
  } 
}
  
/*******************************************************************************
* Function Name  : ReadKeyDown
* Description    : Reads key from demoboard.
* Input          : None
* Output         : None
* Return         : Return KEY1, KEY2, KEY3, KEY4 or NOKEY
* Update         ：www.armjishu.com 
*******************************************************************************/
u8 ReadKeyDown(void)
{
  /* 1 key is pressed */
  if(!GPIO_ReadInputDataBit(GPIO_KEY1_PORT, GPIO_KEY1))
  {
    return KEY1; 
  }	
  /* 2 key is pressed */
  if(!GPIO_ReadInputDataBit(GPIO_KEY2_PORT, GPIO_KEY2))
  {
    return KEY2; 
  }
  /* 3 key is pressed */
  if(!GPIO_ReadInputDataBit(GPIO_KEY3_PORT, GPIO_KEY3))
  {
    return KEY3; 
  }
  /* 4 key is pressed */
  if(!GPIO_ReadInputDataBit(GPIO_KEY4_PORT, GPIO_KEY4))
  {
    return KEY4; 
  }

  /* No key is pressed */
  else 
  {
    return NOKEY;
  }
}

void Key_315M_Wireless_Display(void)
{
    static uint16_t Wireless_Debounce = 0, Key_Debounce = 0;
    __IO uint16_t TextColor, BackColor;
    
    LCD_GetColors(&TextColor, &BackColor);
    /* Set the LCD Text Color */
    LCD_SetTextColor(LCD_COLOR_YELLOW);
    LCD_SetBackColor(LCD_COLOR_RED);
      
    if(Check_315M_Wireless())
    {
        if(1 == Wireless_Debounce)
        {
            Wireless_Debounce++;
            switch(ReadKeyDown())
            {
            case KEY1:
                LCD_DisplayStringLine(Line3, " 315M Wireless Key1 ");
                break;

            case KEY2:
                LCD_DisplayStringLine(Line3, " 315M Wireless Key2 ");
                break;

            case KEY3:
                LCD_DisplayStringLine(Line3, " 315M Wireless Key3 ");
                break;

            case KEY4:
                LCD_DisplayStringLine(Line3, " 315M Wireless Key4 ");
                break;

            default:
                Wireless_Debounce = 0;
            }
        }
        else
        {
            Wireless_Debounce = 1;
        }
    }
    else
    {
        Wireless_Debounce = 0;

        if(NOKEY != ReadKeyDown())
        {
            if(0 == Key_Debounce)
            {
                Key_Debounce= 1;
            }
            else
            {
                if(1 == Key_Debounce)
                {
                    Key_Debounce++;

