fanqh/ETH_Mange/Project/src/stm32f107 - 副本.c
                    switch(ReadKeyDown())
                    {
                    case KEY1:
                        LCD_DisplayStringLine(Line3, " Key1               ");
                        break;

                    case KEY2:
                        LCD_DisplayStringLine(Line3, "      Key2          ");
                        break;

                    case KEY3:
                        LCD_DisplayStringLine(Line3, "           Key3     ");
                        break;

                    case KEY4:
                        LCD_DisplayStringLine(Line3, "               Key4 ");
                        break;

                    default:
                        Key_Debounce = 0;
                    }
                }
            }
        }
        else
        {
            Key_Debounce = 0;
        }
    }    

    /* Set back the LCD Color */
    LCD_SetTextColor(TextColor);
    LCD_SetBackColor(BackColor);
    
}



void Time_Display(uint32_t TimeVar)
{
  uint32_t THH = 0, TMM = 0, TSS = 0;
  uint8_t  TimeStr[] = "                    "; 

  /* Compute  hours */
  THH = (TimeVar / 3600)%24;
  /* Compute minutes */
  TMM = (TimeVar % 3600) / 60;
  /* Compute seconds */
  TSS = (TimeVar % 3600) % 60;

  printf("Time: %0.2d:%0.2d:%0.2d\r", THH, TMM, TSS);
  sprintf((char *)TimeStr, "  Time:  %0.2d:%0.2d:%0.2d  ", THH, TMM, TSS);
  LCD_DisplayStringLine(Line5, TimeStr);
}


/**
  * @brief  Configures the RTC.
  * @param  None
  * @retval None
  */
void RTC_Configuration(void)
{
  /* Enable PWR and BKP clocks */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR | RCC_APB1Periph_BKP, ENABLE);

  /* Allow access to BKP Domain */
  PWR_BackupAccessCmd(ENABLE);

  /* Enable LSE */
  RCC_LSEConfig(RCC_LSE_ON);
  /* Wait till LSE is ready */
  while (RCC_GetFlagStatus(RCC_FLAG_LSERDY) == RESET)
  {}

  /* Select LSE as RTC Clock Source */
  RCC_RTCCLKConfig(RCC_RTCCLKSource_LSE);

  /* Enable RTC Clock */
  RCC_RTCCLKCmd(ENABLE);

  /* Wait for RTC registers synchronization */
  RTC_WaitForSynchro();

  /* Wait until last write operation on RTC registers has finished */
  RTC_WaitForLastTask();

  /* Set RTC prescaler: set RTC period to 1sec */
  RTC_SetPrescaler(32767); /* RTC period = RTCCLK/RTC_PR = (32.768 KHz)/(32767+1) */

  /* Wait until last write operation on RTC registers has finished */
  RTC_WaitForLastTask();
}

void Delay_TouchScreen(__IO uint32_t nCount)
{
  for (; nCount != 0; nCount--)
    ARMJISHU_TouchScreen();
}


void  RTC_Test(void)
{
  static uint32_t localtime = 0;

  RTC_Configuration();
    
  printf(" show Time:\n\r"); 
  localtime = RTC_GetCounter();
  Time_Display(localtime);
  while(RTC_GetCounter() == localtime );

  localtime = RTC_GetCounter();
  Time_Display(localtime);
  while(RTC_GetCounter() == localtime );
  
  localtime = RTC_GetCounter();
  Time_Display(localtime);

  printf("\n\r");
}
/******************* (C) COPYRIGHT 2010 www.armjishu.com 神舟系列*****END OF FILE****/
